[{"releaseDate":"July 1st 1950","score":83,"desc":"Among the seminal texts of the 20th century, Nineteen Eighty-Four is a rare work that grows more haunting as its futuristic purgatory becomes more real. Published in 1949, the book offers political satirist George Orwell's nightmare vision of a totalitarian, bureaucratic world and one poor stiff's attempt to find individuality. The brilliance of the novel is Orwell's prescience of modern life--the ubiquity of television, the distortion of the language--and his ability to construct such a thorough version of hell. Required reading for students since it was published, it ranks among the most terrifying novels ever written.","imageLink":"https://images.gr-assets.com/books/1348990566l/5470.jpg","name":"1984 by George Orwell","type":"book","id":0,"trackers":{"likes":0,"reviews":0}},{"releaseDate":"May 1st 1997","score":80,"desc":"After a tumble down the rabbit hole, Alice finds herself far away from home in the absurd world of Wonderland. As mind-bending as it is delightful, Lewis Carroll’s 1865 novel is pure magic for young and old alike.","imageLink":"https://images.gr-assets.com/books/1391204048l/6324090.jpg","name":"Alice's Adventures in Wonderland by Lewis Carroll","type":"book","id":1,"trackers":{"likes":0,"reviews":0}},{"releaseDate":"May 6th 2003","score":78,"desc":"As ferociously fresh as it was more than a half century ago, this remarkable allegory of a downtrodden society of overworked, mistreated animals, and their quest to create a paradise of progress, justice, and equality is one of the most scathing satires ever published. As we witness the rise and bloody fall of the revolutionary animals, we begin to recognize the seeds of totalitarianism in the most idealistic organization; and in our most charismatic leaders, the souls of our cruelest oppressors.","imageLink":"https://images.gr-assets.com/books/1424037542l/7613.jpg","name":"Animal Farm by George Orwell","type":"book","id":2,"trackers":{"likes":0,"reviews":0}},{"releaseDate":"2004","score":79,"desc":"Fahrenheit 451 ofrece la historia de un sombrío y horroroso futuro. Montag, el protagonista, pertenece a una extraña brigada de bomberos cuya misión, paradójicamente, no es la de sofocar incendios sino la de provocarlos, para quemar libros. Porque en el país de Montag está terminantemente prohibido leer. Porque leer obliga a pensar, y en el país de Montag esta prohibido pensar. Porque leer impide ser ingenuamente feliz, y en el país de Montag hay que ser feliz a la fuerza...","imageLink":"https://images.gr-assets.com/books/1351643740l/4381.jpg","name":"Fahrenheit 451 by Ray Bradbury","type":"book","id":3,"trackers":{"likes":0,"reviews":0}},{"releaseDate":"March 8th 2018","score":75,"desc":"Mary Shelley began writing Frankenstein when she was only eighteen. At once a Gothic thriller, a passionate romance, and a cautionary tale about the dangers of science, Frankenstein tells the story of committed science student Victor Frankenstein. Obsessed with discovering the cause of generation and life and bestowing animation upon lifeless matter, Frankenstein assembles a human being from stolen body parts but; upon bringing it to life, he recoils in horror at the creature's hideousness. Tormented by isolation and loneliness, the once-innocent creature turns to evil and unleashes a campaign of murderous revenge against his creator, Frankenstein.Frankenstein, an instant bestseller and an important ancestor of both the horror and science fiction genres, not only tells a terrifying story, but also raises profound, disturbing questions about the very nature of life and the place of humankind within the cosmos: What does it mean to be human? What responsibilities do we have to each other? How far can we go in tampering with Nature? In our age, filled with news of organ donation genetic engineering, and bio-terrorism, these questions are more relevant than ever.","imageLink":"https://images.gr-assets.com/books/1498841231l/35031085.jpg","name":"Frankenstein by Mary Wollstonecraft Shelley","type":"book","id":4,"trackers":{"likes":0,"reviews":0}},{"releaseDate":"February 4th 2003","score":82,"desc":"Fiery love, shocking twists of fate, and tragic mysteries put a lonely governess in jeopardy in JANE EYRE Orphaned as a child, Jane has felt an outcast her whole young life. Her courage is tested once again when she arrives at Thornfield Hall, where she has been hired by the brooding, proud Edward Rochester to care for his ward Adèle. Jane finds herself drawn to his troubled yet kind spirit. She falls in love. Hard. But there is a terrifying secret inside the gloomy, forbidding Thornfield Hall. Is Rochester hiding from Jane? Will Jane be left heartbroken and exiled once again?","imageLink":"https://images.gr-assets.com/books/1327867269l/10210.jpg","name":"Jane Eyre by Charlotte Brontë","type":"book","id":5,"trackers":{"likes":0,"reviews":0}},{"releaseDate":"October 1st 1999","score":73,"desc":"At the dawn of the next world war, a plane crashes on an uncharted island, stranding a group of schoolboys. At first, with no adult supervision, their freedom is something to celebrate; this far from civilization the boys can do anything they want. Anything. They attempt to forge their own society, failing, however, in the face of terror, sin and evil. And as order collapses, as strange howls echo in the night, as terror begins its reign, the hope of adventure seems as far from reality as the hope of being rescued. Labeled a parable, an allegory, a myth, a morality tale, a parody, a political treatise, even a vision of the apocalypse, Lord of the Flies is perhaps our most memorable tale about “the end of innocence, the darkness of man’s heart.”","imageLink":"https://images.gr-assets.com/books/1327869409l/7624.jpg","name":"Lord of the Flies by William Golding","type":"book","id":6,"trackers":{"likes":0,"reviews":0}},{"releaseDate":"June 4th 2007","score":83,"desc":"What more can a mystery addict desire than a much-loathed murder victim found aboard the luxurious Orient Express with multiple stab wounds, thirteen likely suspects, an incomparably brilliant detective in Hercule Poirot, and the most ingenious crime ever conceived?","imageLink":"https://images.gr-assets.com/books/1486131451l/853510.jpg","name":"Murder on the Orient Express by Agatha Christie","type":"book","id":7,"trackers":{"likes":0,"reviews":0}},{"releaseDate":"January 8th 2002","score":77,"desc":"The compelling story of two outsiders striving to find their place in an unforgiving world. Drifters in search of work, George and his simple-minded friend Lennie have nothing in the world except each other and a dream--a dream that one day they will have some land of their own. Eventually they find work on a ranch in California’s Salinas Valley, but their hopes are doomed as Lennie, struggling against extreme cruelty, misunderstanding and feelings of jealousy, becomes a victim of his own strength. Tackling universal themes such as the friendship of a shared vision, and giving voice to America’s lonely and dispossessed, Of Mice and Men has proved one of Steinbeck’s most popular works, achieving success as a novel, a Broadway play and three acclaimed films.","imageLink":"https://images.gr-assets.com/books/1511302904l/890.jpg","name":"Of Mice and Men by John Steinbeck","type":"book","id":8,"trackers":{"likes":0,"reviews":0}},{"releaseDate":"October 10th 2000","score":85,"desc":"'It is a truth universally acknowledged, that a single man in possession of a good fortune must be in want of a wife.' Thus memorably begins Jane Austen's Pride and Prejudice, one of the world's most popular novels. Pride and Prejudice--Austen's own 'darling child'--tells the story of fiercely independent Elizabeth Bennett, one of five sisters who must marry rich, as she confounds the arrogant, wealthy Mr. Darcy. What ensues is one of the most delightful and engrossingly readable courtships known to literature, written by a precocious Austen when she was just twenty-one years old.Humorous and profound, and filled with highly entertaining dialogue, this witty comedy of manners dips and turns through drawing-rooms and plots to reach an immensely satisfying finale.","imageLink":"https://images.gr-assets.com/books/1320399351l/1885.jpg","name":"Pride and Prejudice by Jane Austen","type":"book","id":9,"trackers":{"likes":0,"reviews":0}},{"releaseDate":"January 1st 2004","score":74,"desc":"In Romeo and Juliet, Shakespeare creates a world of violence and generational conflict in which two young people fall in love and die because of that love. The story is rather extraordinary in that the normal problems faced by young lovers are here so very large. It is not simply that the families of Romeo and Juliet disapprove of the lover's affection for each other; rather, the Montagues and the Capulets are on opposite sides in a blood feud and are trying to kill each other on the streets of Verona. Every time a member of one of the two families dies in the fight, his relatives demand the blood of his killer. Because of the feud, if Romeo is discovered with Juliet by her family, he will be killed. Once Romeo is banished, the only way that Juliet can avoid being married to someone else is to take a potion that apparently kills her, so that she is burried with the bodies of her slain relatives. In this violent, death-filled world, the movement of the story from love at first sight to the union of the lovers in death seems almost inevitable.What is so striking about this play is that despite its extraordinary setting (one perhaps reflecting Elizabethan attitudes about hot-blooded Italians), it has become the quintessential story of young love. Because most young lovers feel that they have to overcome giant obstacles in order to be together, because they feel that they would rather die than be kept apart, and especially because the language Shakespeare gives his young lovers is so exquisite, allowing them to say to each other just what we would all say to a lover if we only knew how, it is easy to respond to this play as if it were about all young lovers rather than about a particular couple in a very unusual world. (When the play was rewritten in the eighteen century as The History and Fall of Caius Marius, the violent setting became that of a particularly discordant period in classical Rome; when Leonard Berstein rewrote the play as West Side Story, he chose the violent world of New York street gangs.)","imageLink":"https://images.gr-assets.com/books/1327872146l/18135.jpg","name":"Romeo and Juliet by William Shakespeare","type":"book","id":10,"trackers":{"likes":0,"reviews":0}},{"releaseDate":"April 29th 2003","score":81,"desc":"'The more I know of the world, the more am I convinced that I shall never see a man whom I can really love. I require so much!'Marianne Dashwood wears her heart on her sleeve, and when she falls in love with the dashing but unsuitable John Willoughby she ignores her sister Elinor's warning that her impulsive behaviour leaves her open to gossip and innuendo. Meanwhile Elinor, always sensitive to social convention, is struggling to conceal her own romantic disappointment, even from those closest to her. Through their parallel experience of love—and its threatened loss—the sisters learn that sense must mix with sensibility if they are to find personal happiness in a society where status and money govern the rules of love.This edition includes explanatory notes, textual variants between the first and second editions, and Tony Tanner's introduction to the original Penguin Classic edition.","imageLink":"https://images.gr-assets.com/books/1397245675l/14935.jpg","name":"Sense and Sensibility by Jane Austen","type":"book","id":11,"trackers":{"likes":0,"reviews":0}},{"releaseDate":"December 1st 1981","score":80,"desc":"Herman Hesse's classic novel has delighted, inspired, and influenced generations of readers, writers, and thinkers. In this story of a wealthy Indian Brahmin who casts off a life of privilege to seek spiritual fulfillment. Hesse synthesizes disparate philosophies--Eastern religions, Jungian archetypes, Western individualism--into a unique vision of life as expressed through one man's search for meaning.","imageLink":"https://images.gr-assets.com/books/1428715580l/52036.jpg","name":"Siddhartha by Hermann Hesse","type":"book","id":12,"trackers":{"likes":0,"reviews":0}},{"releaseDate":"December 31st 2002","score":76,"desc":"A nineteenth-century boy from a Mississippi River town recounts his adventures as he travels down the river with a runaway slave, encountering a family involved in a feud, two scoundrels pretending to be royalty, and Tom Sawyer's aunt who mistakes him for Tom.","imageLink":"https://images.gr-assets.com/books/1405973850l/2956.jpg","name":"The Adventures of Huckleberry Finn by Mark Twain","type":"book","id":13,"trackers":{"likes":0,"reviews":0}},{"releaseDate":"May 1st 1993","score":76,"desc":"Paulo Coelho's masterpiece tells the mystical story of Santiago, an Andalusian shepherd boy who yearns to travel in search of a worldly treasure. His quest will lead him to riches far different—and far more satisfying—than he ever imagined. Santiago's journey teaches us about the essential wisdom of listening to our hearts, of recognizing opportunity and learning to read the omens strewn along life's path, and, most importantly, to follow our dreams.","imageLink":"https://images.gr-assets.com/books/1483412266l/865.jpg","name":"The Alchemist by Paulo Coelho","type":"book","id":14,"trackers":{"likes":0,"reviews":0}},{"releaseDate":"January 30th 2001","score":76,"desc":"The hero-narrator of The Catcher in the Rye is an ancient child of sixteen, a native New Yorker named Holden Caulfield. Through circumstances that tend to preclude adult, secondhand description, he leaves his prep school in Pennsylvania and goes underground in New York City for three days. The boy himself is at once too simple and too complex for us to make any final comment about him or his story. Perhaps the safest thing we can say about Holden is that he was born in the world not just strongly attracted to beauty but, almost, hopelessly impaled on it. There are many voices in this novel: children's voices, adult voices, underground voices-but Holden's voice is the most eloquent of all. Transcending his own vernacular, yet remaining marvelously faithful to it, he issues a perfectly articulated cry of mixed pain and pleasure. However, like most lovers and clowns and poets of the higher orders, he keeps most of the pain to, and for, himself. The pleasure he gives away, or sets aside, with all his heart. It is there for the reader who can handle it to keep. J.D. Salinger's classic novel of teenage angst and rebellion was first published in 1951. The novel was included on Time's 2005 list of the 100 best English-language novels written since 1923. It was named by Modern Library and its readers as one of the 100 best English-language novels of the 20th century. It has been frequently challenged in the court for its liberal use of profanity and portrayal of sexuality and in the 1950's and 60's it was the novel that every teenage boy wants to read.","imageLink":"https://images.gr-assets.com/books/1398034300l/5107.jpg","name":"The Catcher in the Rye by J.D. Salinger","type":"book","id":15,"trackers":{"likes":0,"reviews":0}},{"releaseDate":"2004","score":78,"desc":"A true classic of twentieth-century literature, this edition has been updated by Fitzgerald scholar James L.W. West III to include the author’s final revisions and features a note on the composition and text, a personal foreword by Fitzgerald’s granddaughter, Eleanor Lanahan—and a new introduction by two-time National Book Award winner Jesmyn Ward.The Great Gatsby, F. Scott Fitzgerald’s third book, stands as the supreme achievement of his career. First published in 1925, this quintessential novel of the Jazz Age has been acclaimed by generations of readers. The story of the mysteriously wealthy Jay Gatsby and his love for the beautiful Daisy Buchanan, of lavish parties on Long Island at a time when The New York Times noted “gin was the national drink and sex the national obsession,” it is an exquisitely crafted tale of America in the 1920s.","imageLink":"https://images.gr-assets.com/books/1528221267l/4671.jpg","name":"The Great Gatsby by F. Scott Fitzgerald","type":"book","id":16,"trackers":{"likes":0,"reviews":0}},{"releaseDate":"March 16th 1998","score":81,"desc":"Offred is a Handmaid in the Republic of Gilead. She may leave the home of the Commander and his wife once a day to walk to food markets whose signs are now pictures instead of words because women are no longer allowed to read. She must lie on her back once a month and pray that the Commander makes her pregnant, because in an age of declining births, Offred and the other Handmaids are valued only if their ovaries are viable. Offred can remember the years before, when she lived and made love with her husband, Luke; when she played with and protected her daughter; when she had a job, money of her own, and access to knowledge. But all of that is gone now...","imageLink":"https://images.gr-assets.com/books/1498057733l/38447.jpg","name":"The Handmaid's Tale by Margaret Atwood","type":"book","id":17,"trackers":{"likes":0,"reviews":0}},{"releaseDate":"June 29th 2000","score":85,"desc":"Moral allegory and spiritual autobiography, The Little Prince is the most translated book in the French language. With a timeless charm it tells the story of a little boy who leaves the safety of his own tiny planet to travel the universe, learning the vagaries of adult behaviour through a series of extraordinary encounters. His personal odyssey culminates in a voyage to Earth and further adventures.","imageLink":"https://images.gr-assets.com/books/1367545443l/157993.jpg","name":"The Little Prince by Antoine de Saint-Exupéry","type":"book","id":18,"trackers":{"likes":0,"reviews":0}},{"releaseDate":"1996","score":74,"desc":"It is the story of an old Cuban fisherman and his supreme ordeal: a relentless, agonizing battle with a giant marlin far out in the Gulf Stream. Using the simple, powerful language of a fable, Hemingway takes the timeless themes of courage in the face of defeat and personal triumph won from loss and transforms them into a magnificent twentieth-century classic.","imageLink":"https://images.gr-assets.com/books/1329189714l/2165.jpg","name":"The Old Man and the Sea by Ernest Hemingway","type":"book","id":19,"trackers":{"likes":0,"reviews":0}},{"releaseDate":"June 1st 2004","score":81,"desc":"﻿Written in his distinctively dazzling manner, Oscar Wilde’s story of a fashionable young man who sells his soul for eternal youth and beauty is the author’s most popular work. The tale of Dorian Gray’s moral disintegration caused a scandal when it ﬁrst appeared in 1890, but though Wilde was attacked for the novel’s corrupting inﬂuence, he responded that there is, in fact, “a terrible moral in Dorian Gray.” Just a few years later, the book and the aesthetic/moral dilemma it presented became issues in the trials occasioned by Wilde’s homosexual liaisons, which resulted in his imprisonment. Of Dorian Gray’s relationship to autobiography, Wilde noted in a letter, “Basil Hallward is what I think I am: Lord Henry what the world thinks me: Dorian what I would like to be—in other ages, perhaps.”","imageLink":"https://images.gr-assets.com/books/1424596966l/5297.jpg","name":"The Picture of Dorian Gray by Oscar Wilde","type":"book","id":20,"trackers":{"likes":0,"reviews":0}},{"releaseDate":"March 28th 1989","score":79,"desc":"Through the story of an ordinary man unwittingly drawn into a senseless murder on an Algerian beach, Camus explored what he termed \"the nakedness of man faced with the absurd.\" First published in English in 1946; now in a new translation by Matthew Ward.","imageLink":"https://images.gr-assets.com/books/1349927872l/49552.jpg","name":"The Stranger by Albert Camus","type":"book","id":21,"trackers":{"likes":0,"reviews":0}},{"releaseDate":"May 23rd 2006","score":85,"desc":"The unforgettable novel of a childhood in a sleepy Southern town and the crisis of conscience that rocked it, To Kill A Mockingbird became both an instant bestseller and a critical success when it was first published in 1960. It went on to win the Pulitzer Prize in 1961 and was later made into an Academy Award-winning film, also a classic.Compassionate, dramatic, and deeply moving, To Kill A Mockingbird takes readers to the roots of human behavior - to innocence and experience, kindness and cruelty, love and hatred, humor and pathos. Now with over 18 million copies in print and translated into forty languages, this regional story by a young Alabama woman claims universal appeal. Harper Lee always considered her book to be a simple love story. Today it is regarded as a masterpiece of American literature.","imageLink":"https://images.gr-assets.com/books/1361975680l/2657.jpg","name":"To Kill a Mockingbird (To Kill a Mockingbird, #1) by Harper Lee","type":"book","id":22,"trackers":{"likes":0,"reviews":0}},{"releaseDate":"2002","score":76,"desc":"You can find the redesigned cover of this edition HERE.Wuthering Heights is a wild, passionate story of the intense and almost demonic love between Catherine Earnshaw and Heathcliff, a foundling adopted by Catherine's father. After Mr Earnshaw's death, Heathcliff is bullied and humiliated by Catherine's brother Hindley and wrongly believing that his love for Catherine is not reciprocated, leaves Wuthering Heights, only to return years later as a wealthy and polished man. He proceeds to exact a terrible revenge for his former miseries. The action of the story is chaotic and unremittingly violent, but the accomplished handling of a complex structure, the evocative descriptions of the lonely moorland setting and the poetic grandeur of vision combine to make this unique novel a masterpiece of English literature.","imageLink":"https://images.gr-assets.com/books/1388212715l/6185.jpg","name":"Wuthering Heights by Emily Brontë","type":"book","id":23,"trackers":{"likes":0,"reviews":0}}]